/**
  ******************************************************************************
  * 文件: app_syspower.c
  * 作者: steve
  * 版本: V1.0.0
  * 描述: 系统电源中间件，实现系统电源控制API
  ******************************************************************************
  *
  *                  版权所有 (C): steve
  *                                
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include "custom.h"

/**
  * 描述: 电源控制初始化
  * 参数: 无
  * 返回: 无
  */
void drv_syspower_init(void)
{
    app_syspower_ctl(POWER_OFF);
}
/**
  * 描述: 电源开关控制
  * 参数: onf: 电源开关状态
  * 返回: 无
  */
void app_syspower_ctl(POWER_CTL_t onf)
{
    if(onf == POWER_ON)
    {
        app_syspower_on();
    }else
    {
        app_syspower_off();
    }
}
/**
  * 描述: 电源开控制
  * 参数: 
  * 返回: 无
  */
void app_syspower_on(void)
{

}
/**
  * 描述: 电源关控制
  * 参数: 
  * 返回: 无
  */
void app_syspower_off(void)
{

}

/*************************************************************************************/
