/**
  ******************************************************************************
  * 文件: bsp_usart.h
  * 作者: steve
  * 版本: V1.0.0
  * 描述: 串口中间件头文件
  ******************************************************************************
  *
  *                  版权所有 (C): steve
  *
  *
  ******************************************************************************
  */

/* 防止递归包含该头文件 ------------------------------------------------------*/
#ifndef __BSP_USART_H__
#define __DRV_USART_H

#ifdef __cplusplus
 extern "C" {
#endif

#define     T1_PORT                 (3)
#define     T1_PIN                  (3)

/* Includes ------------------------------------------------------------------*/

void bsp_usart_cfg(void);
void bsp_usart_send_byte(uint8_t ch);
uint16_t bsp_usart_receive_char(void);
void bsp_uart_tx_string(u8 *buf, u8 len);


#ifdef __cplusplus
}
#endif


#endif /* __DRV_USART_H */

/*************************************************************************************/
